Autodesk.Revit.DB.BuiltInFailures.RebarFailures.UnconstrainableRebarHandle
The rebar handle does not have any constraint targets.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TrySmallerBarType
Rebar Bend Diameter is too large. Try a smaller Bar Type.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TooSmallNumberOfBars
Rebar Set must contain at least two bar locations.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TooLargeNumberOfBars
Rebar Set must contain at most 1002 bar locations.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.StandardHookBendDiameterTooSmall
Rebar Standard Hook Bend Diameter is too small.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.StandardHookBendDiameterTooLarge
Rebar Standard Hook Bend Diameter is too large.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchNonPlanarFreeForm
The selected free form rebar is not planar. Sketching it will discard the current geometry.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchFreeFormSet
Sketching of a free form set produces only a single bar.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchDimsBWFRemoved
The sketch dimensions, that were used to create the sketch, have been removed from the completed bend profile definition.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchDimensionsRemoved
The sketch dimensions, that were used to create the sketch, have been removed from the completed rebar shape definition.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarTooShortMetric
The minimum length of rebar shape is 25 mm.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarTooShortImperial
The minimum length of rebar shape is 1 inch.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarSpacingTooSmall
Bar Spacing is too small.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailureCustomWarning
'[ErrorMessage]'

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailureCustomError
'[ErrorMessage]'

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailure
Can't solve Rebar Shape.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarNoMatchingHooks
The Rebar Shape '[Family Name]' has no matching hooks.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarNoConstraints
The constraints for the rebar with free form geometry are not set or modifications have caused the automatic constraints to be deleted.
You can use Edit Constraints to assign new bar constraints.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarIllegalBarType
There is Structural Rebar present in the project that no longer meet the criteria defined in Allowable Rebar Bar
types parameter. Please review all existing Structural Rebar created with this Shape.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarHooksDontMatchShape
The Rebar's hooks do not match its Rebar Shape.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarContainerOutSideOfHostWarning
Rebar Container is placed completely outside of its host.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarConstraintWarning
Structural rebar have automatic constraints that may conflict with dimensional constraints. Using dimensional
constraints with structural rebar is not recommended and should be avoided.\nGrouped structural rebar is the
only exception to this recommendation, since the automatic constraints are removed on grouped rebar.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarBendRadiusTooBigWarn
Rebar Bend Radius is too big. Ignoring bend.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarBendRadiusTooBig
Rebar Bend Radius is too big. Ignoring bend.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarArrayTooShort
Rebar Set can't have coincident Bars.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.PathShapeFailure
Can't solve Rebar Shape in Path Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.OutSideOfHost
Rebar is placed completely outside of its host.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.OutOfPlaneBendDiameterTooSmall
The Out of Plane Bend Diameter for Rebar Shape XX is too small for Rebar Bar Type YY.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoVisibleTargetsForCurrentConstraint
There are no visible constraint targets in the current view. Please switch to another view.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoVisibleRebarHandle
Editing of the constraints for the selected rebar with free form geometry is not available. However, the default automatic constraints may still work.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoSurfPatternOnRebar
Rebar elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Rebar Type.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoRebarSelected
At least one Rebar should be selected.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.MissingCurrentConstraintForHandle
The current handle has no constraint. Please select a valid target to apply a new constraint.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.MaxHookExtensionMultiplierWarn
The allowable range of values for the Rebar Hook Extension Multiplier is from 0.01 to 99.0.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.Inverted3dShape
The Rebar Shape XX cannot be inverted.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostWrongCategory
Rebar can't be placed in a family of category [Name].

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostNonStructural
Rebar can't be placed in a non-structural element.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostNonConcrete
Rebar can't be placed in a structural family unless its [Material Type] is [Concrete].

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostFamilyCanHostRebarParam
Rebar can't be placed in this Generic Model element because rebar hosting is disabled in the family [Name].

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHost
Rebar can be placed only in Concrete Structural elements.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.IncompleteShape
Rebar Shape [Family Name] is not fully defined and cannot be loaded into the project.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.HostTopologyChange
A reinforced host has undergone a major change. The reinforcement must be removed.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.HideAllBarsInRebarSet
All Bars in Rebar Set have been hidden.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.DelayedConstraintForHandle
The selected constraint targets do not satisfy a valid constraint. The rebar preview corresponds to latest valid rebar constraints.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CoverTooLong
Rebar Cover length is too large for host thickness.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.ClearPresentationForAllBarsInRebarSet
All Bars in a Free Form Rebar Set have been hidden.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.ChangeUnitsFormatWarn
The modification of the unit will cause the change of the Reinforcement rounding format. Do you want to continue?

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CantMakeFillets
The bar cannot be bent in that shape. Check the bending diameter and the bar type.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotSolveRebarWithDelayedConstraints
There are rebar handles with invalid selected targets to constrain. The bar preview corresponds to latest valid constraints.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotSolveRebarShapeUsingDataFromDimension
Cannot solve rebar shape using the current constraints.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotPlaceRebarWarn
Can't find a host for Rebar.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotPlaceRebar
Can't find a host for Rebar.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotKeepVariabilityOfRebarInGroup
Modifications to the rebar set might cause it to revert to a uniform distribution. This can occur for layout changes as well as modifications to the geometry.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotCreateFreeFormSetDueToShortBar
Cannot create the rebar set using the current references because at least one bar is below the minimum allowed length. Edit the covers and extents of the set and try the desired layout options again.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.BendDiameterTooSmall
Rebar Bend Diameter is too small.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.BendDiameterTooLarge
Rebar Bend Diameter is too large.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.BarTypeDoesNotAllowHooksOfCurrentShape
You have selected a Bar Type which does not allow the Hooks used by the current shape.  Please select a different Shape / Bar Type combination,  or change the Hook permissions for the desired Bar Type (see Hook Lengths under Rebar Bar properties).

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.BarDiameterTooLarge
Rebar Bar Diameter is too large.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures
Failures about Rebar.